<a href="https://colab.research.google.com/github/yeokyungkim/hello-world-/blob/main/homework_nataliakim.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3


#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal to 4
elif number_of_cake == 4:
 print("We are not happy.")
else:
  print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3

#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal or less than 4
elif number_of_cake < 4 or number_of_cake == 4:
    print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 4

#if you have exactly 4 or less than 4 cakes
if number_of_cake <= 4:
  print("We are not happy.")

#if above conditions is not met
else: 
  print("Everbody is happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 5

if number_of_cake > 4:
  print ("Everyone is happy.")
else:
  print ("We are not happy.")

#if number of cakes is greater than number of student 
  if number_of_cake == 4:
   print("Even though we have 4 cakes, we are still not happy.")

Everyone is happy.

In [ ]:
#Homework_2_cakes_assignment

number_of_cake = 3
number_of_student = 4

#substraction to calculate extra number of cake 
extra_number_of_cake = sub = number_of_cake - number_of_student

#testing if number of cake is greater than 4
if number_of_cake > number_of_student:
  #if true, print below
  print("Everybody is happy.")
  #if false, print below
elif number_of_cake == number_of_student:
  print("We are not happy.")
else:
  print("We are not happy.")


#If there is extra cakes, how many more people can we feed in the classroom? 

if number_of_cake > number_of_student:
  print("If there is" + " " + str(number_of_cake) + " " + "cakes," + " " + "we can feed" + " " + str(sub) + " " + "more people.")

We are not happy.

In [ ]:
# Class Exercise about Loop and Titanic
num = float(input("Enter the number:"))
num = 1
while num < 123:
  print("Passenger" + " " + str(num))
  num = num + 1
print("Passenger" + " " + str(num))

In [ ]:
# Class Exercise about Loop and Titanic_revision

#use the loop method to show the list of passengers on the passenger list
total_number_of_passengers = float(input("Enter the number of passengers:"))

passenger_incrementing = 1
# number of passengers is less than the total number of passengers on the boat
while passenger_incrementing < total_number_of_passengers:
  print("Passenger" + " " + str(passenger_incrementing))
  passenger_incrementing = passenger_incrementing + 1
print("Passenger" + " " + str(passenger_incrementing))

**Homework 3.0 - while** 
-> Request the user to type a number (any positive number) -> decrease is value until 0 (12,11,10, .... 0) 
-> Verify that your program doesn't bug if the user type a negative number (you input a negative number)

In [ ]:
#Homework_3_while

#Ask user to type a random number
number = float(input("Type the number:"))

#number value will decrease by 1 until it reaches 0 and print the number
while number > 0: 
 print(int(number))
 number = number - 1
 
 #if user inputs a number less than 1, system will not generate any more number
 if number <= 0:
   print("0")
   break

Type the number:0

**Homework 4.0** - For from list of ingredients here, create a recipe asking to add all the ingredients to the plate.

ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"] -> "add the apple, the sugar, ..." and that is flexible to the number of ingredients

In [ ]:
#Homework_4_for_ver 1

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 

print("Add the " + ingredient_list[0] + ", " + ingredient_list[1] + ", " + ingredient_list[2] + ", " + ingredient_list[3] + ", " + ingredient_list[4] +".")
#print("Add the " + str(ingredient_list))

Add the apple, sugar, lemon, yogurt, flour.

In [ ]:
#Homework_4_for_ver 2

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 
for ingredient in ingredient_list:
  print("Add the " + str(ingredient) + ".")

Add the apple.
Add the sugar.
Add the lemon.
Add the yogurt.
Add the flour.

In [ ]:
df[df['W']>0]

1. on kaggle -> get csv file of titanic

2. import on google colab

3. Display the imported data

4. Slice data to extract only the Womans of the passengers

**Importing dataframe (.CSV) from Kaggle to Google Colab** **& Displaying the data**

In [25]:
# Importing titanic dataset CSV from Kaggle to dataframe
import pandas as pd

# After importing CSV data, display data by locating file location
list_of_titanic_passengers = pd.read_csv('tested.csv')
display(list_of_titanic_passengers)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Analyzing Titanic Data by Sex**

In [26]:
sorted_values = list_of_titanic_passengers.sort_values("Sex")
display(sorted_values)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
208         1100         1       1  ...   27.7208   A11         C
138         1030         1       3  ...    8.0500   NaN         S
330         1222         1       2  ...   36.7500   NaN         S
140         1032         1       3  ...   46.9000   NaN         S
141         1033         1       1  ...  151.5500   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
167         1059         0       3  ...   34.3750   NaN         S
166         1058         0       1  ...   50.4958   B10         C
164         1056         0       2  ...   13.0000   NaN         S
131         1023         0       1  ...   28.5000   C51         C
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Filtering Titanic Data by Name & Sex**

In [53]:
# Importing titanic dataset CSV from Kaggle to dataframe
import pandas as pd

# After importing CSV data, display data by locating file location
list_of_titanic_passengers = pd.read_csv('tested.csv')

# Filter titanic passengers by Sex 
passenger_sex = list_of_titanic_passengers[["Sex"]]
print(passenger_sex)

        Sex
0      male
1    female
2      male
3      male
4    female
..      ...
413    male
414  female
415    male
416    male
417    male

[418 rows x 1 columns]

**Analyzing Titanic data by Sex using Value Count**

In [56]:
# Importing titanic dataset CSV from Kaggle to dataframe
import pandas as pd

# After importing CSV data, display data by locating file location
list_of_titanic_passengers = pd.read_csv('tested.csv')

list_of_titanic_passengers["Sex"].value_counts()
Sex_map = {"female" = 0, "male" = 1}
list_of_female_passengers= list_of_titanic_passengers[list_of_titanic_passengers["Sex"]==0]
display(list_of_female_passengers)

SyntaxError: ignored

**Saving the data treated from Titanic**

In [ ]:
list_of_titanic_passengers.to_csv('file_name.csv')

## ***March 15 Class Coding Examples***

In [13]:
# Render plots inline
%matplotlib inline

# Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Set style for all graphs
sns.set_style("dark")

**Present first & last 5 data excercises**

In [14]:
# Present first 5 data from imported Titanic data 
list_of_titanic_passengers.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [28]:
# Present last 5 data from imported Titanic data
list_of_titanic_passengers.tail()

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[5 rows x 12 columns]

***Clean up duplicated data ***

In [16]:
# Identify and remove duplicated data
list_of_titanic_passengers = list_of_titanic_passengers.drop_duplicates
print(list_of_titanic_passengers)

<bound method DataFrame.drop_duplicates of      PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]>

In [20]:
# Identify and remove duplicated data
list_of_titanic_passengers = list_of_titanic_passengers.drop_duplicates
display(list_of_titanic_passengers)

<bound method DataFrame.drop_duplicates of      PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]>

**Remove unused columns**

In [29]:
list_of_titanic_passengers_cleaned = list_of_titanic_passengers.drop(['PassengerId','Ticket','Cabin','Fare','Embarked'], axis=1)
list_of_titanic_passengers_cleaned.head()

   Survived  Pclass  ... SibSp Parch
0         0       3  ...     0     0
1         1       3  ...     1     0
2         0       2  ...     0     0
3         0       3  ...     0     0
4         1       3  ...     1     1

[5 rows x 7 columns]

**Fix any missing or data format issue**

In [ ]:
#Calculate number of missing values 
list_of_titanic_passengers_cleaned.isnull().sum()
#Review some of missing age data 
missing_age_bool = pd.isnull(list_of_titanic_passengers_cleaned['Age'])
list_of_titanic_passengers_cleaned[missing_age_bool].head()

    Survived  Pclass  ... SibSp Parch
10         0       3  ...     0     0
22         1       1  ...     0     0
29         0       3  ...     2     0
33         1       3  ...     1     2
36         1       3  ...     0     0

[5 rows x 7 columns]

In [30]:
#Calculate number of missing values 
list_of_titanic_passengers_cleaned.isnull().sum()
#Review some of missing age data 
missing_age_bool = pd.isnull(list_of_titanic_passengers_cleaned['Age'])
list_of_titanic_passengers_cleaned[missing_age_bool].tail()

     Survived  Pclass                             Name  ... Age  SibSp  Parch
408         1       3  Riordan, Miss. Johanna Hannah""  ... NaN      0      0
410         1       3           Naughton, Miss. Hannah  ... NaN      0      0
413         0       3               Spector, Mr. Woolf  ... NaN      0      0
416         0       3              Ware, Mr. Frederick  ... NaN      0      0
417         0       3         Peter, Master. Michael J  ... NaN      1      1

[5 rows x 7 columns]

In [ ]:
#Determine number of males and females with missing age values
missing_age_female = list_of_titanic_passengers_cleaned[missing_age_bool]['Sex'] == 'female'
missing_age_male = list_of_titanic_passengers_cleaned[missing_age_bool]['Sex'] == 'male'
print(missing_age_female.sum())
print(missing_age_male.sum())

25
61

**Data Exploration and Visualization**

In [ ]:
#Looking at some tyoical descriptive statistics 
list_of_titanic_passengers_cleaned.describe()

         Survived      Pclass         Age       SibSp       Parch
count  418.000000  418.000000  332.000000  418.000000  418.000000
mean     0.363636    2.265550   30.272590    0.447368    0.392344
std      0.481622    0.841838   14.181209    0.896760    0.981429
min      0.000000    1.000000    0.170000    0.000000    0.000000
25%      0.000000    1.000000   21.000000    0.000000    0.000000
50%      0.000000    3.000000   27.000000    0.000000    0.000000
75%      1.000000    3.000000   39.000000    1.000000    0.000000
max      1.000000    3.000000   76.000000    8.000000    9.000000

In [ ]:
#filter the date to check on people on board less than 1 year old
people_less_than_1yr_old = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Age'] < 1]
display(people_less_than_1yr_old)

     Survived  Pclass  ... SibSp Parch
201         0       3  ...     0     2
250         1       2  ...     1     2
281         0       3  ...     1     1
307         0       3  ...     0     1
354         1       3  ...     1     2

[5 rows x 7 columns]

In [33]:
#Slice
#exemple : df[df['W']>0][['X','Y']] 

#1- Using slicing : Extract all the male in a dataframe and display it
male_dataframe = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Sex'] == "male"]
display(male_dataframe)

female_dataframe = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Sex'] == "female"]
display(female_dataframe)

#2- Using slicing : Extract all the people who survived in a dataframe and display it
survived_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 1]
display(survived_passengers)

dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0]
display(dead_passengers)
# to extract min / max of a dataframe, add .min() or .max at the end of dataframe :

#- using this, create a variable to answer :
#3- youngest_to_survive = 
#youngest_survived_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 1].min()
#display(youngest_survived_passengers)

youngest_survived_passengers = survived_passengers.min()
print(youngest_survived_passengers)

#4- youngest_to_die = 
#youngest_dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0].min()
#display(youngest_dead_passengers)

youngest_dead_passengers = dead_passengers.min()
print(youngest_dead_passengers)

#5- oldest_to_die =
oldest_dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0].max()
display(oldest_dead_passengers)

#6- oldest_to_survived = 
oldest_survived_passengers = survived_passengers.max()
print(oldest_survived_passengers)

#7- slice the passengers in 3 data frames: using .mean()
Firstclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass'] == 1]
print(Firstclass)

Secondclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass']== 2]
print(Secondclass)

Thirdclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass']== 3]
print(Thirdclass)

AverageageFirstclass = Firstclass['Age'].mean()
print(AverageageFirstclass)

AverageageSecondclass = Secondclass['Age'].mean()
print(AverageageSecondclass)

AverageageThirdclass = Thirdclass['Age'].mean()
print(AverageageThirdclass)

     Survived  Pclass                          Name   Sex   Age  SibSp  Parch
0           0       3              Kelly, Mr. James  male  34.5      0      0
2           0       2     Myles, Mr. Thomas Francis  male  62.0      0      0
3           0       3              Wirz, Mr. Albert  male  27.0      0      0
5           0       3    Svensson, Mr. Johan Cervin  male  14.0      0      0
7           0       2  Caldwell, Mr. Albert Francis  male  26.0      1      1
..        ...     ...                           ...   ...   ...    ...    ...
407         0       1    Widener, Mr. George Dunton  male  50.0      1      1
413         0       3            Spector, Mr. Woolf  male   NaN      0      0
415         0       3  Saether, Mr. Simon Sivertsen  male  38.5      0      0
416         0       3           Ware, Mr. Frederick  male   NaN      0      0
417         0       3      Peter, Master. Michael J  male   NaN      1      1

[266 rows x 7 columns]

     Survived  Pclass  ... SibSp Parch
1           1       3  ...     1     0
4           1       3  ...     1     1
6           1       3  ...     0     0
8           1       3  ...     0     0
12          1       1  ...     1     0
..        ...     ...  ...   ...   ...
409         1       3  ...     1     1
410         1       3  ...     0     0
411         1       1  ...     1     0
412         1       3  ...     0     0
414         1       1  ...     0     0

[152 rows x 7 columns]

     Survived  Pclass  ... SibSp Parch
1           1       3  ...     1     0
4           1       3  ...     1     1
6           1       3  ...     0     0
8           1       3  ...     0     0
12          1       1  ...     1     0
..        ...     ...  ...   ...   ...
409         1       3  ...     1     1
410         1       3  ...     0     0
411         1       1  ...     1     0
412         1       3  ...     0     0
414         1       1  ...     0     0

[152 rows x 7 columns]

     Survived  Pclass                          Name   Sex   Age  SibSp  Parch
0           0       3              Kelly, Mr. James  male  34.5      0      0
2           0       2     Myles, Mr. Thomas Francis  male  62.0      0      0
3           0       3              Wirz, Mr. Albert  male  27.0      0      0
5           0       3    Svensson, Mr. Johan Cervin  male  14.0      0      0
7           0       2  Caldwell, Mr. Albert Francis  male  26.0      1      1
..        ...     ...                           ...   ...   ...    ...    ...
407         0       1    Widener, Mr. George Dunton  male  50.0      1      1
413         0       3            Spector, Mr. Woolf  male   NaN      0      0
415         0       3  Saether, Mr. Simon Sivertsen  male  38.5      0      0
416         0       3           Ware, Mr. Frederick  male   NaN      0      0
417         0       3      Peter, Master. Michael J  male   NaN      1      1

[266 rows x 7 columns]

Survived                              1
Pclass                                1
Name        Abelseth, Miss. Karen Marie
Sex                              female
Age                                0.17
SibSp                                 0
Parch                                 0
dtype: object
Survived                                0
Pclass                                  1
Name        Abbott, Master. Eugene Joseph
Sex                                  male
Age                                  0.33
SibSp                                   0
Parch                                   0
dtype: object

Survived                                    0
Pclass                                      3
Name        van Billiard, Master. Walter John
Sex                                      male
Age                                        67
SibSp                                       8
Parch                                       9
dtype: object

Survived                                                1
Pclass                                                  3
Name        del Carlo, Mrs. Sebastiano (Argenia Genovesi)
Sex                                                female
Age                                                    76
SibSp                                                   8
Parch                                                   9
dtype: object
     Survived  Pclass  ... SibSp Parch
11          0       1  ...     0     0
12          1       1  ...     1     0
14          1       1  ...     1     0
20          0       1  ...     1     0
22          1       1  ...     0     0
..        ...     ...  ...   ...   ...
403         0       1  ...     0     0
404         0       1  ...     1     0
407         0       1  ...     1     1
411         1       1  ...     1     0
414         1       1  ...     0     0

[107 rows x 7 columns]
     Survived  Pclass  ... SibSp Parch
2           0       2  ...     0     0
7           0       2  ...     1     1
13          0       2  ...     1     0
15          1       2  ...     1     0
16          0       2  ...     0     0
..        ...     ...  ...   ...   ...
387         0       2  ...     0     0
393         0       2  ...     0     0
401         0       2  ...     1     0
405         0       2  ...     0     0
406         0       2  ...     1     0

[93 rows x 7 columns]
     Survived  Pclass  ... SibSp Parch
0           0       3  ...     0     0
1           1       3  ...     1     0
3           0       3  ...     0     0
4           1       3  ...     1     1
5           0       3  ...     0     0
..        ...     ...  ...   ...   ...
412         1       3  ...     0     0
413         0       3  ...     0     0
415         0       3  ...     0     0
416         0       3  ...     0     0
417         0       3  ...     1     1

[218 rows x 7 columns]
40.91836734693877
28.7775
24.02794520547945

### **Restaurant Class Excercise (Top250.csv)**

https://www.kaggle.com/michau96/restaurant-business-rankings-2020

In [2]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")
display(restaurant_list)

#Slicing : Filter restaurnats by filter and find average ranks
ChickenRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Chicken"]
display(ChickenRestaurantList)

AvgRankOfChickenRestaurant=ChickenRestaurantList['Rank'].mean()
print(AvgRankOfChickenRestaurant)

BurgerRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Burger"]
display(BurgerRestaurantList)

CoffeeRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Coffee Cafe"]
display(CoffeeRestaurantList)

AvgRankOfCoffeeRestaurnt=CoffeeRestaurantList['Rank'].mean()
print(AvgRankOfCoffeeRestaurnt)

     Rank           Restaurant  ... Headquarters             Segment_Category
0       1           McDonald's  ...          NaN       Quick Service & Burger
1       2            Starbucks  ...          NaN  Quick Service & Coffee Cafe
2       3          Chick-fil-A  ...          NaN      Quick Service & Chicken
3       4            Taco Bell  ...          NaN      Quick Service & Mexican
4       5          Burger King  ...          NaN       Quick Service & Burger
..    ...                  ...  ...          ...                          ...
245   246      Rainforest Cafe  ...          NaN                  Varied Menu
246   247                  PDQ  ...          NaN                      Chicken
247   248        Lupe Tortilla  ...          NaN                      Mexican
248   249  Cook-Out Restaurant  ...          NaN                       Burger
249   250             Jollibee  ...          NaN                      Chicken

[250 rows x 9 columns]

    Rank                 Restaurant  ... Headquarters         Segment_Category
2      3                Chick-fil-A  ...          NaN  Quick Service & Chicken
13    14                        KFC  ...          NaN  Quick Service & Chicken
18    19  Popeyes Louisiana Kitchen  ...          NaN  Quick Service & Chicken
46    47                 Bojangles'  ...          NaN  Quick Service & Chicken
53    54              El Pollo Loco  ...          NaN  Quick Service & Chicken
64    65           Church's Chicken  ...          NaN  Quick Service & Chicken

[6 rows x 9 columns]

33.666666666666664

    Rank                     Restaurant  ... Headquarters        Segment_Category
0      1                     McDonald's  ...          NaN  Quick Service & Burger
4      5                    Burger King  ...          NaN  Quick Service & Burger
6      7                        Wendy's  ...          NaN  Quick Service & Burger
12    13                 Sonic Drive-In  ...          NaN  Quick Service & Burger
23    24                Jack in the Box  ...          NaN  Quick Service & Burger
29    30                    Whataburger  ...          NaN  Quick Service & Burger
34    35                       Hardee's  ...          NaN  Quick Service & Burger
37    38                       Culver's  ...          NaN  Quick Service & Burger
42    43                     Carl's Jr.  ...          NaN  Quick Service & Burger
49    50                In-N-Out Burger  ...          NaN  Quick Service & Burger
50    51                 Steak 'n Shake  ...          NaN  Quick Service & Burger
75    76                   White Castle  ...          NaN  Quick Service & Burger
84    85  Checkers Drive-In Restaurants  ...          NaN  Quick Service & Burger

[13 rows x 9 columns]

    Rank          Restaurant  ... Headquarters             Segment_Category
1      2           Starbucks  ...          NaN  Quick Service & Coffee Cafe
7      8             Dunkin'  ...          NaN  Quick Service & Coffee Cafe
65    66         Tim Hortons  ...  Toronto, ON  Quick Service & Coffee Cafe
78    79  Dutch Bros. Coffee  ...          NaN  Quick Service & Coffee Cafe

[4 rows x 9 columns]

38.75

# **Homework: Loop method by category (Avg. rank/ restaurant type)**

In [14]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")

#list segment category list from the dataset
list_segment_category = restaurant_list['Segment_Category'].unique()
print(list_segment_category)

#Find Average value / Segment category
for category in list_segment_category:
 Average = restaurant_list[restaurant_list['Segment_Category']== category].mean()
print(Average)

['Quick Service & Burger' 'Quick Service & Coffee Cafe'
 'Quick Service & Chicken' 'Quick Service & Mexican'
 'Quick Service & Sandwich' 'Quick Service & Pizza'
 'Fast Casual & Bakery Cafe' 'Fast Casual & Mexican'
 'Casual Dining & Italian/Pizza' 'Casual Dining & Varied Menu'
 'Fast Casual & Asian/Noodle' 'Quick Service & Frozen Desserts'
 'Casual Dining & Sports Bar' 'Family Dining & Family Style'
 'Casual Dining & Steak' 'Casual Dining & Seafood'
 'Fast Casual & Sandwich' 'Fast Casual & Chicken'
 'Quick Service & Family Casual' 'Fast Casual & Burger'
 'Casual Dining & Asian' 'Quick Service & Snack' 'Steak'
 'Quick Service & Beverage' 'Sports Bar' 'Quick Service & Seafood'
 'Quick Service & Bakery Cafe' 'Fast Casual & Pizza' 'Fine Dining & Steak'
 'Mexican' 'Varied Menu' 'Chicken' 'Italian/Pizza' 'Pizza' 'Seafood'
 'Frozen Desserts' 'Coffee Cafe' 'BBQ' 'Sandwich' 'Bakery Cafe' 'Burger'
 'Asian' 'Family Style' 'Asian/Noodle' 'Family Casual' 'Snack' 'Healthy'
 'Ethnic']
Rank            220.0
Content           NaN
Sales           149.0
Units            93.0
Headquarters      NaN
dtype: float64

In [70]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")

#list segment category list from the dataset
list_segment_category = restaurant_list['Segment_Category'].unique()
for category in list_segment_category:
  Slice = restaurant_list[restaurant_list['Segment_Category']==category][["Rank"]]
  AverageOfThisCategory = Slice.mean()
  print(category + ": Average = " + str(AverageOfThisCategory))
  print("-----")

Quick Service & Burger: Average = Rank    35.230769
dtype: float64
-----
Quick Service & Coffee Cafe: Average = Rank    38.75
dtype: float64
-----
Quick Service & Chicken: Average = Rank    33.666667
dtype: float64
-----
Quick Service & Mexican: Average = Rank    30.5
dtype: float64
-----
Quick Service & Sandwich: Average = Rank    56.0
dtype: float64
-----
Quick Service & Pizza: Average = Rank    49.5
dtype: float64
-----
Fast Casual & Bakery Cafe: Average = Rank    10.0
dtype: float64
-----
Fast Casual & Mexican: Average = Rank    41.666667
dtype: float64
-----
Casual Dining & Italian/Pizza: Average = Rank    62.5
dtype: float64
-----
Casual Dining & Varied Menu: Average = Rank    45.555556
dtype: float64
-----
Fast Casual & Asian/Noodle: Average = Rank    51.5
dtype: float64
-----
Quick Service & Frozen Desserts: Average = Rank    47.0
dtype: float64
-----
Casual Dining & Sports Bar: Average = Rank    58.666667
dtype: float64
-----
Family Dining & Family Style: Average = Rank    50.428571
dtype: float64
-----
Casual Dining & Steak: Average = Rank    46.0
dtype: float64
-----
Casual Dining & Seafood: Average = Rank    53.0
dtype: float64
-----
Fast Casual & Sandwich: Average = Rank    59.833333
dtype: float64
-----
Fast Casual & Chicken: Average = Rank    53.0
dtype: float64
-----
Quick Service & Family Casual: Average = Rank    39.0
dtype: float64
-----
Fast Casual & Burger: Average = Rank    71.5
dtype: float64
-----
Casual Dining & Asian: Average = Rank    52.0
dtype: float64
-----
Quick Service & Snack: Average = Rank    68.0
dtype: float64
-----
Steak: Average = Rank    135.444444
dtype: float64
-----
Quick Service & Beverage: Average = Rank    86.333333
dtype: float64
-----
Sports Bar: Average = Rank    179.833333
dtype: float64
-----
Quick Service & Seafood: Average = Rank    80.0
dtype: float64
-----
Quick Service & Bakery Cafe: Average = Rank    87.0
dtype: float64
-----
Fast Casual & Pizza: Average = Rank    93.0
dtype: float64
-----
Fine Dining & Steak: Average = Rank    96.0
dtype: float64
-----
Mexican: Average = Rank    169.0
dtype: float64
-----
Varied Menu: Average = Rank    181.318182
dtype: float64
-----
Chicken: Average = Rank    205.857143
dtype: float64
-----
Italian/Pizza: Average = Rank    176.0
dtype: float64
-----
Pizza: Average = Rank    143.111111
dtype: float64
-----
Seafood: Average = Rank    183.125
dtype: float64
-----
Frozen Desserts: Average = Rank    178.5
dtype: float64
-----
Coffee Cafe: Average = Rank    181.5
dtype: float64
-----
BBQ: Average = Rank    186.285714
dtype: float64
-----
Sandwich: Average = Rank    150.142857
dtype: float64
-----
Bakery Cafe: Average = Rank    177.875
dtype: float64
-----
Burger: Average = Rank    176.5
dtype: float64
-----
Asian: Average = Rank    199.0
dtype: float64
-----
Family Style: Average = Rank    169.8
dtype: float64
-----
Asian/Noodle: Average = Rank    173.666667
dtype: float64
-----
Family Casual: Average = Rank    180.25
dtype: float64
-----
Snack: Average = Rank    209.25
dtype: float64
-----
Healthy: Average = Rank    185.0
dtype: float64
-----
Ethnic: Average = Rank    220.0
dtype: float64
-----

In [15]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")

#list segment category list from the dataset
list_segment_category = restaurant_list['Segment_Category'].unique()
print(list_segment_category)

#Find Maximum value / Segment category
for category in list_segment_category:
 Maximum = restaurant_list[restaurant_list['Segment_Category']== category].max()
 print(Maximum)

['Quick Service & Burger' 'Quick Service & Coffee Cafe'
 'Quick Service & Chicken' 'Quick Service & Mexican'
 'Quick Service & Sandwich' 'Quick Service & Pizza'
 'Fast Casual & Bakery Cafe' 'Fast Casual & Mexican'
 'Casual Dining & Italian/Pizza' 'Casual Dining & Varied Menu'
 'Fast Casual & Asian/Noodle' 'Quick Service & Frozen Desserts'
 'Casual Dining & Sports Bar' 'Family Dining & Family Style'
 'Casual Dining & Steak' 'Casual Dining & Seafood'
 'Fast Casual & Sandwich' 'Fast Casual & Chicken'
 'Quick Service & Family Casual' 'Fast Casual & Burger'
 'Casual Dining & Asian' 'Quick Service & Snack' 'Steak'
 'Quick Service & Beverage' 'Sports Bar' 'Quick Service & Seafood'
 'Quick Service & Bakery Cafe' 'Fast Casual & Pizza' 'Fine Dining & Steak'
 'Mexican' 'Varied Menu' 'Chicken' 'Italian/Pizza' 'Pizza' 'Seafood'
 'Frozen Desserts' 'Coffee Cafe' 'BBQ' 'Sandwich' 'Bakery Cafe' 'Burger'
 'Asian' 'Family Style' 'Asian/Noodle' 'Family Casual' 'Snack' 'Healthy'
 'Ethnic']
Rank                                    85
Restaurant                    White Castle
Sales                                40412
YOY_Sales                             5.8%
Units                                13846
YOY_Units                             6.7%
Headquarters                           NaN
Segment_Category    Quick Service & Burger
dtype: object
Rank                                     1
Restaurant                     Burger King
Sales                                  535
YOY_Sales                            -1.8%
Units                                  351
YOY_Units                            -0.2%
Headquarters                           NaN
Segment_Category    Quick Service & Burger
dtype: object
Rank                                         79
Restaurant                          Tim Hortons
Sales                                     21380
YOY_Sales                                  8.6%
Units                                     15049
YOY_Units                                  3.0%
Segment_Category    Quick Service & Coffee Cafe
dtype: object
Rank                                          2
Restaurant                              Dunkin'
Sales                                       567
YOY_Sales                                 -3.5%
Units                                       369
YOY_Units                                 -1.7%
Segment_Category    Quick Service & Coffee Cafe
dtype: object
Rank                                       65
Restaurant          Popeyes Louisiana Kitchen
Sales                                   11320
YOY_Sales                                3.0%
Units                                    4065
YOY_Units                                5.5%
Headquarters                              NaN
Segment_Category      Quick Service & Chicken
dtype: object
Rank                                      3
Restaurant                       Bojangles'
Sales                                   716
YOY_Sales                             -5.2%
Units                                   482
YOY_Units                             -0.2%
Headquarters                            NaN
Segment_Category    Quick Service & Chicken
dtype: object
Rank                                     57
Restaurant                        Taco Bell
Content                                 NaN
Sales                                 11293
YOY_Sales                              9.0%
Units                                  6766
YOY_Units                              2.8%
Headquarters                            NaN
Segment_Category    Quick Service & Mexican
dtype: object
Rank                                      4
Restaurant                         Del Taco
Content                                 NaN
Sales                                   850
YOY_Sales                              4.0%
Units                                   596
YOY_Units                              2.7%
Headquarters                            NaN
Segment_Category    Quick Service & Mexican
dtype: object
Rank                                     101
Restaurant                            Subway
Sales                                  10200
YOY_Sales                               4.9%
Units                                  23801
YOY_Units                               2.3%
Headquarters                             NaN
Segment_Category    Quick Service & Sandwich
dtype: object
Rank                                       6
Restaurant                            Arby's
Sales                                    435
YOY_Sales                              -2.0%
Units                                    471
YOY_Units                              -1.5%
Headquarters                             NaN
Segment_Category    Quick Service & Sandwich
dtype: object
Rank                                  100
Restaurant              Round Table Pizza
Sales                                7044
YOY_Sales                            7.0%
Units                                7306
YOY_Units                            4.3%
Headquarters                          NaN
Segment_Category    Quick Service & Pizza
dtype: object
Rank                                    9
Restaurant                       Domino's
Sales                                 439
YOY_Sales                           -2.7%
Units                                 435
YOY_Units                           -0.6%
Headquarters                          NaN
Segment_Category    Quick Service & Pizza
dtype: object
Rank                                       10
Restaurant                       Panera Bread
Content                                   NaN
Sales                                    5890
YOY_Sales                                4.0%
Units                                    2160
YOY_Units                                3.2%
Headquarters                              NaN
Segment_Category    Fast Casual & Bakery Cafe
dtype: object
Rank                                       10
Restaurant                       Panera Bread
Content                                   NaN
Sales                                    5890
YOY_Sales                                4.0%
Units                                    2160
YOY_Units                                3.2%
Headquarters                              NaN
Segment_Category    Fast Casual & Bakery Cafe
dtype: object
Rank                                   60
Restaurant             Qdoba Mexican Eats
Content                               NaN
Sales                                5509
YOY_Sales                            5.9%
Units                                2584
YOY_Units                            5.3%
Headquarters                          NaN
Segment_Category    Fast Casual & Mexican
dtype: object
Rank                                    12
Restaurant          Chipotle Mexican Grill
Content                                NaN
Sales                                  749
YOY_Sales                            14.8%
Units                                  730
YOY_Units                            -2.9%
Headquarters                           NaN
Segment_Category     Fast Casual & Mexican
dtype: object
Rank                                           95
Restaurant                           Olive Garden
Sales                                        4287
YOY_Sales                                    5.0%
Units                                         866
YOY_Units                                    1.3%
Headquarters                                  NaN
Segment_Category    Casual Dining & Italian/Pizza
dtype: object
Rank                                           15
Restaurant               California Pizza Kitchen
Sales                                         461
YOY_Sales                                   -0.3%
Units                                         187
YOY_Units                                   -0.5%
Headquarters                                  NaN
Segment_Category    Casual Dining & Italian/Pizza
dtype: object
Rank                                         74
Restaurant                           Yard House
Sales                                      4085
YOY_Sales                                  6.6%
Units                                      1665
YOY_Units                                  9.7%
Headquarters                                NaN
Segment_Category    Casual Dining & Varied Menu
dtype: object
Rank                                         16
Restaurant                           Applebee's
Sales                                       609
YOY_Sales                                 -0.3%
Units                                        79
YOY_Units                                 -0.7%
Headquarters                                NaN
Segment_Category    Casual Dining & Varied Menu
dtype: object
Rank                                                               86
Restaurant                                              Panda Express
Content             The chain followed up on its successful 2018 i...
Sales                                                            3946
YOY_Sales                                                       12.0%
Units                                                            2209
YOY_Units                                                        4.9%
Headquarters                                                      NaN
Segment_Category                           Fast Casual & Asian/Noodle
dtype: object
Rank                                                               17
Restaurant                                          Noodles & Company
Content             Panda Express has quietly established itself a...
Sales                                                             533
YOY_Sales                                                        0.9%
Units                                                             457
YOY_Units                                                       -0.4%
Headquarters                                                      NaN
Segment_Category                           Fast Casual & Asian/Noodle
dtype: object
Rank                                             73
Restaurant                              Dairy Queen
Content                                         NaN
Sales                                          3760
YOY_Sales                                      2.9%
Units                                          4381
YOY_Units                                     -1.0%
Headquarters                                    NaN
Segment_Category    Quick Service & Frozen Desserts
dtype: object
Rank                                             21
Restaurant                           Baskin-Robbins
Content                                         NaN
Sales                                           615
YOY_Sales                                      0.6%
Units                                          2524
YOY_Units                                     -0.6%
Headquarters                                    NaN
Segment_Category    Quick Service & Frozen Desserts
dtype: object
Rank                                        98
Restaurant                  Miller's Ale House
Content                                    NaN
Sales                                     3669
YOY_Sales                                10.2%
Units                                     1206
YOY_Units                                11.4%
Headquarters                               NaN
Segment_Category    Casual Dining & Sports Bar
dtype: object
Rank                                        22
Restaurant                  Buffalo Wild Wings
Content                                    NaN
Sales                                      446
YOY_Sales                                -0.1%
Units                                       98
YOY_Units                                -0.2%
Headquarters                               NaN
Segment_Category    Casual Dining & Sports Bar
dtype: object
Rank                                          83
Restaurant                          Waffle House
Sales                                       3266
YOY_Sales                                  35.1%
Units                                       1959
YOY_Units                                  24.7%
Headquarters                                 NaN
Segment_Category    Family Dining & Family Style
dtype: object
Rank                                          25
Restaurant                             Bob Evans
Sales                                        541
YOY_Sales                                  -4.2%
Units                                        309
YOY_Units                                  -1.4%
Headquarters                                 NaN
Segment_Category    Family Dining & Family Style
dtype: object
Rank                                   92
Restaurant                Texas Roadhouse
Content                               NaN
Sales                                3016
YOY_Sales                            6.3%
Units                                 724
YOY_Units                            3.8%
Headquarters                          NaN
Segment_Category    Casual Dining & Steak
dtype: object
Rank                                   26
Restaurant              Logan's Roadhouse
Content                               NaN
Sales                                 496
YOY_Sales                           -3.7%
Units                                 204
YOY_Units                           -1.0%
Headquarters                          NaN
Segment_Category    Casual Dining & Steak
dtype: object
Rank                                     75
Restaurant                      Red Lobster
Content                                 NaN
Sales                                  2490
YOY_Sales                              1.6%
Units                                   679
YOY_Units                              0.1%
Headquarters                            NaN
Segment_Category    Casual Dining & Seafood
dtype: object
Rank                                     31
Restaurant                   Bonefish Grill
Content                                 NaN
Sales                                   587
YOY_Sales                             -0.9%
Units                                   197
YOY_Units                              0.0%
Headquarters                            NaN
Segment_Category    Casual Dining & Seafood
dtype: object
Rank                                    89
Restaurant                      Portillo's
Content                                NaN
Sales                                 2105
YOY_Sales                             7.0%
Units                                 2787
YOY_Units                             8.8%
Headquarters                           NaN
Segment_Category    Fast Casual & Sandwich
dtype: object
Rank                                    34
Restaurant                  Firehouse Subs
Content                                NaN
Sales                                  505
YOY_Sales                            -1.1%
Units                                   62
YOY_Units                            -0.5%
Headquarters                           NaN
Segment_Category    Fast Casual & Sandwich
dtype: object
Rank                                   90
Restaurant                        Zaxby's
Sales                                1886
YOY_Sales                            6.0%
Units                                1231
YOY_Units                            9.5%
Headquarters                          NaN
Segment_Category    Fast Casual & Chicken
dtype: object
Rank                                   36
Restaurant                  Boston Market
Sales                                 501
YOY_Sales                           -9.9%
Units                                 390
YOY_Units                          -14.1%
Headquarters                          NaN
Segment_Category    Fast Casual & Chicken
dtype: object
Rank                                           39
Restaurant                          Golden Corral
Content                                       NaN
Sales                                        1746
YOY_Sales                                    0.8%
Units                                         483
YOY_Units                                   -1.2%
Headquarters                                  NaN
Segment_Category    Quick Service & Family Casual
dtype: object
Rank                                           39
Restaurant                          Golden Corral
Content                                       NaN
Sales                                        1746
YOY_Sales                                    0.8%
Units                                         483
YOY_Units                                   -1.2%
Headquarters                                  NaN
Segment_Category    Quick Service & Family Casual
dtype: object
Rank                                    91
Restaurant          The Habit Burger Grill
Content                                NaN
Sales                                 1661
YOY_Sales                             7.4%
Units                                 1368
YOY_Units                            27.2%
Headquarters                           NaN
Segment_Category      Fast Casual & Burger
dtype: object
Rank                                         40
Restaurant          Five Guys Burgers and Fries
Content                                     NaN
Sales                                       500
YOY_Sales                                 12.9%
Units                                       173
YOY_Units                                  0.7%
Headquarters                                NaN
Segment_Category           Fast Casual & Burger
dtype: object
Rank                                   52
Restaurant                   P.F. Chang's
Content                               NaN
Sales                                 917
YOY_Sales                            1.4%
Units                                 221
YOY_Units                            0.0%
Headquarters                          NaN
Segment_Category    Casual Dining & Asian
dtype: object
Rank                                   52
Restaurant                   P.F. Chang's
Content                               NaN
Sales                                 917
YOY_Sales                            1.4%
Units                                 221
YOY_Units                            0.0%
Headquarters                          NaN
Segment_Category    Casual Dining & Asian
dtype: object
Rank                                   81
Restaurant                   Krispy Kreme
Content                               NaN
Sales                                 887
YOY_Sales                            4.4%
Units                                1288
YOY_Units                            4.0%
Headquarters                          NaN
Segment_Category    Quick Service & Snack
dtype: object
Rank                                   55
Restaurant                  Auntie Anne's
Content                               NaN
Sales                                 559
YOY_Sales                            0.2%
Units                                 364
YOY_Units                           -0.5%
Headquarters                          NaN
Segment_Category    Quick Service & Snack
dtype: object
Rank                                         203
Restaurant          Texas de Brazil Churrascaria
Content                                      NaN
Sales                                        703
YOY_Sales                                   9.7%
Units                                        135
YOY_Units                                   9.4%
Segment_Category                           Steak
dtype: object
Rank                                    67
Restaurant          Black Angus Steakhouse
Content                                NaN
Sales                                  168
YOY_Sales                            -1.5%
Units                                   16
YOY_Units                            -1.6%
Segment_Category                     Steak
dtype: object
Rank                                      94
Restaurant            Tropical Smoothie Cafe
Content                                  NaN

In [19]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")

#list segment category list from the dataset
list_segment_category = restaurant_list['Segment_Category'].unique()
print(list_segment_category)

for category in list_segment_category:
#Find Minimum value / Segment category
 Minimum = restaurant_list[restaurant_list['Segment_Category']== category].min()
 print(Minimum)

['Quick Service & Burger' 'Quick Service & Coffee Cafe'
 'Quick Service & Chicken' 'Quick Service & Mexican'
 'Quick Service & Sandwich' 'Quick Service & Pizza'
 'Fast Casual & Bakery Cafe' 'Fast Casual & Mexican'
 'Casual Dining & Italian/Pizza' 'Casual Dining & Varied Menu'
 'Fast Casual & Asian/Noodle' 'Quick Service & Frozen Desserts'
 'Casual Dining & Sports Bar' 'Family Dining & Family Style'
 'Casual Dining & Steak' 'Casual Dining & Seafood'
 'Fast Casual & Sandwich' 'Fast Casual & Chicken'
 'Quick Service & Family Casual' 'Fast Casual & Burger'
 'Casual Dining & Asian' 'Quick Service & Snack' 'Steak'
 'Quick Service & Beverage' 'Sports Bar' 'Quick Service & Seafood'
 'Quick Service & Bakery Cafe' 'Fast Casual & Pizza' 'Fine Dining & Steak'
 'Mexican' 'Varied Menu' 'Chicken' 'Italian/Pizza' 'Pizza' 'Seafood'
 'Frozen Desserts' 'Coffee Cafe' 'BBQ' 'Sandwich' 'Bakery Cafe' 'Burger'
 'Asian' 'Family Style' 'Asian/Noodle' 'Family Casual' 'Snack' 'Healthy'
 'Ethnic']
Rank                                     1
Restaurant                     Burger King
Sales                                  535
YOY_Sales                            -1.8%
Units                                  351
YOY_Units                            -0.2%
Headquarters                           NaN
Segment_Category    Quick Service & Burger
dtype: object
Rank                                          2
Restaurant                              Dunkin'
Sales                                       567
YOY_Sales                                 -3.5%
Units                                       369
YOY_Units                                 -1.7%
Segment_Category    Quick Service & Coffee Cafe
dtype: object
Rank                                      3
Restaurant                       Bojangles'
Sales                                   716
YOY_Sales                             -5.2%
Units                                   482
YOY_Units                             -0.2%
Headquarters                            NaN
Segment_Category    Quick Service & Chicken
dtype: object
Rank                                      4
Restaurant                         Del Taco
Content                                 NaN
Sales                                   850
YOY_Sales                              4.0%
Units                                   596
YOY_Units                              2.7%
Headquarters                            NaN
Segment_Category    Quick Service & Mexican
dtype: object
Rank                                       6
Restaurant                            Arby's
Sales                                    435
YOY_Sales                              -2.0%
Units                                    471
YOY_Units                              -1.5%
Headquarters                             NaN
Segment_Category    Quick Service & Sandwich
dtype: object
Rank                                    9
Restaurant                       Domino's
Sales                                 439
YOY_Sales                           -2.7%
Units                                 435
YOY_Units                           -0.6%
Headquarters                          NaN
Segment_Category    Quick Service & Pizza
dtype: object
Rank                                       10
Restaurant                       Panera Bread
Content                                   NaN
Sales                                    5890
YOY_Sales                                4.0%
Units                                    2160
YOY_Units                                3.2%
Headquarters                              NaN
Segment_Category    Fast Casual & Bakery Cafe
dtype: object
Rank                                    12
Restaurant          Chipotle Mexican Grill
Content                                NaN
Sales                                  749
YOY_Sales                            14.8%
Units                                  730
YOY_Units                            -2.9%
Headquarters                           NaN
Segment_Category     Fast Casual & Mexican
dtype: object
Rank                                           15
Restaurant               California Pizza Kitchen
Sales                                         461
YOY_Sales                                   -0.3%
Units                                         187
YOY_Units                                   -0.5%
Headquarters                                  NaN
Segment_Category    Casual Dining & Italian/Pizza
dtype: object
Rank                                         16
Restaurant                           Applebee's
Sales                                       609
YOY_Sales                                 -0.3%
Units                                        79
YOY_Units                                 -0.7%
Headquarters                                NaN
Segment_Category    Casual Dining & Varied Menu
dtype: object
Rank                                                               17
Restaurant                                          Noodles & Company
Content             Panda Express has quietly established itself a...
Sales                                                             533
YOY_Sales                                                        0.9%
Units                                                             457
YOY_Units                                                       -0.4%
Headquarters                                                      NaN
Segment_Category                           Fast Casual & Asian/Noodle
dtype: object
Rank                                             21
Restaurant                           Baskin-Robbins
Content                                         NaN
Sales                                           615
YOY_Sales                                      0.6%
Units                                          2524
YOY_Units                                     -0.6%
Headquarters                                    NaN
Segment_Category    Quick Service & Frozen Desserts
dtype: object
Rank                                        22
Restaurant                  Buffalo Wild Wings
Content                                    NaN
Sales                                      446
YOY_Sales                                -0.1%
Units                                       98
YOY_Units                                -0.2%
Headquarters                               NaN
Segment_Category    Casual Dining & Sports Bar
dtype: object
Rank                                          25
Restaurant                             Bob Evans
Sales                                        541
YOY_Sales                                  -4.2%
Units                                        309
YOY_Units                                  -1.4%
Headquarters                                 NaN
Segment_Category    Family Dining & Family Style
dtype: object
Rank                                   26
Restaurant              Logan's Roadhouse
Content                               NaN
Sales                                 496
YOY_Sales                           -3.7%
Units                                 204
YOY_Units                           -1.0%
Headquarters                          NaN
Segment_Category    Casual Dining & Steak
dtype: object
Rank                                     31
Restaurant                   Bonefish Grill
Content                                 NaN
Sales                                   587
YOY_Sales                             -0.9%
Units                                   197
YOY_Units                              0.0%
Headquarters                            NaN
Segment_Category    Casual Dining & Seafood
dtype: object
Rank                                    34
Restaurant                  Firehouse Subs
Content                                NaN
Sales                                  505
YOY_Sales                            -1.1%
Units                                   62
YOY_Units                            -0.5%
Headquarters                           NaN
Segment_Category    Fast Casual & Sandwich
dtype: object
Rank                                   36
Restaurant                  Boston Market
Sales                                 501
YOY_Sales                           -9.9%
Units                                 390
YOY_Units                          -14.1%
Headquarters                          NaN
Segment_Category    Fast Casual & Chicken
dtype: object
Rank                                           39
Restaurant                          Golden Corral
Content                                       NaN
Sales                                        1746
YOY_Sales                                    0.8%
Units                                         483
YOY_Units                                   -1.2%
Headquarters                                  NaN
Segment_Category    Quick Service & Family Casual
dtype: object
Rank                                         40
Restaurant          Five Guys Burgers and Fries
Content                                     NaN
Sales                                       500
YOY_Sales                                 12.9%
Units                                       173
YOY_Units                                  0.7%
Headquarters                                NaN
Segment_Category           Fast Casual & Burger
dtype: object
Rank                                   52
Restaurant                   P.F. Chang's
Content                               NaN
Sales                                 917
YOY_Sales                            1.4%
Units                                 221
YOY_Units                            0.0%
Headquarters                          NaN
Segment_Category    Casual Dining & Asian
dtype: object
Rank                                   55
Restaurant                  Auntie Anne's
Content                               NaN
Sales                                 559
YOY_Sales                            0.2%
Units                                 364
YOY_Units                           -0.5%
Headquarters                          NaN
Segment_Category    Quick Service & Snack
dtype: object
Rank                                    67
Restaurant          Black Angus Steakhouse
Content                                NaN
Sales                                  168
YOY_Sales                            -1.5%
Units                                   16
YOY_Units                            -1.6%
Segment_Category                     Steak
dtype: object
Rank                                      77
Restaurant                             Jamba
Content                                  NaN
Sales                                    462
YOY_Sales                               0.8%
Units                                    767
YOY_Units                              -1.8%
Headquarters                             NaN
Segment_Category    Quick Service & Beverage
dtype: object
Rank                              78
Restaurant          Beef 'O' Brady's
Sales                            133
YOY_Sales                      -5.0%
Units                             33
YOY_Units                      -2.5%
Segment_Category          Sports Bar
dtype: object
Rank                                         80
Restaurant          Captain D's Seafood Kitchen
Content                                     NaN
Sales                                       561
YOY_Sales                                  3.1%
Units                                       540
YOY_Units                                  2.1%
Headquarters                                NaN
Segment_Category        Quick Service & Seafood
dtype: object
Rank                                         87
Restaurant                Einstein Bros. Bagels
Content                                     NaN
Sales                                       517
YOY_Sales                                 -2.1%
Units                                       710
YOY_Units                                 -2.6%
Headquarters                                NaN
Segment_Category    Quick Service & Bakery Cafe
dtype: object
Rank                                 93
Restaurant                    MOD Pizza
Content                             NaN
Sales                               483
YOY_Sales                         23.8%
Units                               467
YOY_Units                         18.2%
Headquarters                        NaN
Segment_Category    Fast Casual & Pizza
dtype: object
Rank                                 96
Restaurant           The Capital Grille
Content                             NaN
Sales                               461
YOY_Sales                          4.7%
Units                                58
YOY_Units                          0.0%
Headquarters                        NaN
Segment_Category    Fine Dining & Steak
dtype: object
Rank                                   102
Restaurant          Cafe Rio Mexican Grill
Content                                NaN
Sales                                  127
YOY_Sales                            -0.1%
Units                                   25
YOY_Units                            -1.3%
Segment_Category                   Mexican
dtype: object
Rank                                                103
Restaurant          54th Street Restaurant & Drafthouse
Sales                                               129
YOY_Sales                                        -10.2%
Units                                                13
YOY_Units                                        -11.4%
Segment_Category                            Varied Menu
dtype: object
Rank                                104
Restaurant          Chicken Salad Chick
Sales                               126
YOY_Sales                         -2.1%
Units                                40
YOY_Units                         -1.5%
Segment_Category                Chicken
dtype: object
Rank                                       105
Restaurant          Anthony's Coal Fired Pizza
Content                                    NaN
Sales                                      150
YOY_Sales                               -12.9%
Units                                       42
YOY_Units                                -1.3%
Segment_Category                 Italian/Pizza
dtype: object
Rank                        106
Restaurant          Blaze Pizza
Content                     NaN
Sales                       179
YOY_Sales                 -0.5%
Units                       165
YOY_Units                 -1.0%
Segment_Category          Pizza
dtype: object
Rank                                  107
Restaurant          Bubba Gump Shrimp Co.
Content                               NaN
Sales                                 144
YOY_Sales                           -1.9%
Units                                  16
YOY_Units                          -14.6%
Segment_Category                  Seafood
dtype: object
Rank                                             112
Restaurant          Braum's Ice Cream & Dairy Stores
Content                                          NaN
Sales                                            132
YOY_Sales                                      -2.3%
Units                                            267
YOY_Units                                      -0.9%
Segment_Category                     Frozen Desserts
dtype: object
Rank                          114
Restaurant          Biggby Coffee
Sales                         129
YOY_Sales                   -2.1%
Units                         240
YOY_Units                   -0.7%
Segment_Category      Coffee Cafe
dtype: object
Rank                                115
Restaurant          Bill Miller Bar-B-Q
Sales                               129
YOY_Sales                         -1.3%
Units                                61
YOY_Units                        -11.1%
Segment_Category                    BBQ
dtype: object
Rank                     116
Restaurant          Fazoli's
Sales                    193
YOY_Sales              -0.5%
Units                    121
YOY_Units              -0.8%
Segment_Category    Sandwich
dtype: object
Rank                        117
Restaurant          Au Bon Pain
Sales                       148
YOY_Sales                 -1.9%
Units                        81
YOY_Units                 -0.5%
Segment_Category    Bakery Cafe
dtype: object
Rank                                  118
Restaurant          A&W All-American Food
Sales                                 126
YOY_Sales                          -15.8%
Units                                  93
YOY_Units                          -10.7%
Segment_Category                   Burger
dtype: object
Rank                     119
Restaurant          Benihana
Content                  NaN
Sales                    129
YOY_Sales               1.6%
Units                     17
YOY_Units               0.0%
Segment_Category       Asian
dtype: object
Rank                                     121
Restaurant          Big Boy/Frisch's Big Boy
Sales                                    152
YOY_Sales                             -15.3%
Units                                     63
YOY_Units                              -0.8%
Segment_Category                Family Style
dtype: object
Rank                                137
Restaurant          Pei Wei Asian Diner
Content                             NaN
Sales                               132
YOY_Sales                        -12.5%
Units                               150
YOY_Units                         -0.4%
Segment_Category           Asian/Noodle
dtype: object
Rank                          149
Restaurant                 Luby's
Sales                         142
YOY_Sales                  -18.8%
Units                          49
YOY_Units                  -24.6%
Segment_Category    Family Casual
dtype: object
Rank                     171
Restaurant          Cinnabon
Content                  NaN
Sales                    132
YOY_Sales               2.2%
Units                    353
YOY_Units               0.2%
Headquarters             NaN
Segment_Category       Snack
dtype: object
Rank                                                              185
Restaurant                                                 Sweetgreen
Content             In June, Sweetgreen made its first acquisition...
Sales                                                             184
YOY_Sales                                                       16.8%
Units                                                             102
YOY_Units                                                       10.9%
Headquarters                                                      NaN
Segment_Category                                              Healthy
dtype: object
Rank                                        220
Restaurant          Taziki's Mediterranean Cafe
Content                                     NaN
Sales                                       149
YOY_Sales                                 11.9%
Units                                        93
YOY_Units                                  6.9%
Headquarters                                NaN
Segment_Category                         Ethnic
dtype: object

In [34]:
#Adding the pandas library
import pandas as pd
#Importing the dataset to a dataframe
restaurant_list = pd.read_csv("Top250.csv")

#list segment category list from the dataset
list_segment_category = restaurant_list['Segment_Category'].unique()
print(list_segment_category)

#print the average value of rank / restaurant category
for category in list_segment_category:
  Ranking = restaurant_list[restaurant_list['Segment_Category']== category][["Rank"]]
  print(category + " - " + str(Ranking.mean()))
  print("------")

['Quick Service & Burger' 'Quick Service & Coffee Cafe'
 'Quick Service & Chicken' 'Quick Service & Mexican'
 'Quick Service & Sandwich' 'Quick Service & Pizza'
 'Fast Casual & Bakery Cafe' 'Fast Casual & Mexican'
 'Casual Dining & Italian/Pizza' 'Casual Dining & Varied Menu'
 'Fast Casual & Asian/Noodle' 'Quick Service & Frozen Desserts'
 'Casual Dining & Sports Bar' 'Family Dining & Family Style'
 'Casual Dining & Steak' 'Casual Dining & Seafood'
 'Fast Casual & Sandwich' 'Fast Casual & Chicken'
 'Quick Service & Family Casual' 'Fast Casual & Burger'
 'Casual Dining & Asian' 'Quick Service & Snack' 'Steak'
 'Quick Service & Beverage' 'Sports Bar' 'Quick Service & Seafood'
 'Quick Service & Bakery Cafe' 'Fast Casual & Pizza' 'Fine Dining & Steak'
 'Mexican' 'Varied Menu' 'Chicken' 'Italian/Pizza' 'Pizza' 'Seafood'
 'Frozen Desserts' 'Coffee Cafe' 'BBQ' 'Sandwich' 'Bakery Cafe' 'Burger'
 'Asian' 'Family Style' 'Asian/Noodle' 'Family Casual' 'Snack' 'Healthy'
 'Ethnic']
Quick Service & Burger - Rank    35.230769
dtype: float64
------
Quick Service & Coffee Cafe - Rank    38.75
dtype: float64
------
Quick Service & Chicken - Rank    33.666667
dtype: float64
------
Quick Service & Mexican - Rank    30.5
dtype: float64
------
Quick Service & Sandwich - Rank    56.0
dtype: float64
------
Quick Service & Pizza - Rank    49.5
dtype: float64
------
Fast Casual & Bakery Cafe - Rank    10.0
dtype: float64
------
Fast Casual & Mexican - Rank    41.666667
dtype: float64
------
Casual Dining & Italian/Pizza - Rank    62.5
dtype: float64
------
Casual Dining & Varied Menu - Rank    45.555556
dtype: float64
------
Fast Casual & Asian/Noodle - Rank    51.5
dtype: float64
------
Quick Service & Frozen Desserts - Rank    47.0
dtype: float64
------
Casual Dining & Sports Bar - Rank    58.666667
dtype: float64
------
Family Dining & Family Style - Rank    50.428571
dtype: float64
------
Casual Dining & Steak - Rank    46.0
dtype: float64
------
Casual Dining & Seafood - Rank    53.0
dtype: float64
------
Fast Casual & Sandwich - Rank    59.833333
dtype: float64
------
Fast Casual & Chicken - Rank    53.0
dtype: float64
------
Quick Service & Family Casual - Rank    39.0
dtype: float64
------
Fast Casual & Burger - Rank    71.5
dtype: float64
------
Casual Dining & Asian - Rank    52.0
dtype: float64
------
Quick Service & Snack - Rank    68.0
dtype: float64
------
Steak - Rank    135.444444
dtype: float64
------
Quick Service & Beverage - Rank    86.333333
dtype: float64
------
Sports Bar - Rank    179.833333
dtype: float64
------
Quick Service & Seafood - Rank    80.0
dtype: float64
------
Quick Service & Bakery Cafe - Rank    87.0
dtype: float64
------
Fast Casual & Pizza - Rank    93.0
dtype: float64
------
Fine Dining & Steak - Rank    96.0
dtype: float64
------
Mexican - Rank    169.0
dtype: float64
------
Varied Menu - Rank    181.318182
dtype: float64
------
Chicken - Rank    205.857143
dtype: float64
------
Italian/Pizza - Rank    176.0
dtype: float64
------
Pizza - Rank    143.111111
dtype: float64
------
Seafood - Rank    183.125
dtype: float64
------
Frozen Desserts - Rank    178.5
dtype: float64
------
Coffee Cafe - Rank    181.5
dtype: float64
------
BBQ - Rank    186.285714
dtype: float64
------
Sandwich - Rank    150.142857
dtype: float64
------
Bakery Cafe - Rank    177.875
dtype: float64
------
Burger - Rank    176.5
dtype: float64
------
Asian - Rank    199.0
dtype: float64
------
Family Style - Rank    169.8
dtype: float64
------
Asian/Noodle - Rank    173.666667
dtype: float64
------
Family Casual - Rank    180.25
dtype: float64
------
Snack - Rank    209.25
dtype: float64
------
Healthy - Rank    185.0
dtype: float64
------
Ethnic - Rank    220.0
dtype: float64
------

## **Class example: Looping 10 times**

In [27]:
a = "Hello"
b = "World"
index = 0

#Loop 10 times and print Hello World with Loop number next to it
while index < 10:
 c = a + b + str(index + 1)
 print(c)
 index += 1

HelloWorld1
HelloWorld2
HelloWorld3
HelloWorld4
HelloWorld5
HelloWorld6
HelloWorld7
HelloWorld8
HelloWorld9
HelloWorld10

# **Class practice: Print number 99 times from 100 to 1**

In [31]:
#option 1
index = 100
while 0 <index < 101:
  print(index)
  index -=1

100
99
98
97
96
95
94
93
92
91
90
89
88
87
86
85
84
83
82
81
80
79
78
77
76
75
74
73
72
71
70
69
68
67
66
65
64
63
62
61
60
59
58
57
56
55
54
53
52
51
50
49
48
47
46
45
44
43
42
41
40
39
38
37
36
35
34
33
32
31
30
29
28
27
26
25
24
23
22
21
20
19
18
17
16
15
14
13
12
11
10
9
8
7
6
5
4
3
2
1

In [32]:
#option 2 
index = 100
while index >0:
  c=index
  print(c)
  index -=1

100
99
98
97
96
95
94
93
92
91
90
89
88
87
86
85
84
83
82
81
80
79
78
77
76
75
74
73
72
71
70
69
68
67
66
65
64
63
62
61
60
59
58
57
56
55
54
53
52
51
50
49
48
47
46
45
44
43
42
41
40
39
38
37
36
35
34
33
32
31
30
29
28
27
26
25
24
23
22
21
20
19
18
17
16
15
14
13
12
11
10
9
8
7
6
5
4
3
2
1

# Homework (April 1):  https://www.kaggle.com/shivamb/netflix-shows/code

-> Download the csv of netflix movies
1. print the first 5 rows of this dataframe
2. print the info of the dataframe
3. print the last 10 rows of this dataframe
4. print all the films produced in the US

In [36]:
#adding the csv file to the pandas library
import pandas as pd
#Importing the dataset to a dataframe
film_list = pd.read_csv("netflix_titles.csv")
#print the first 5 rows of this dataframe
print(film_list.head())

  show_id  ...                                        description
0      s1  ...  In a future where the elite inhabit an island ...
1      s2  ...  After a devastating earthquake hits Mexico Cit...
2      s3  ...  When an army recruit is found dead, his fellow...
3      s4  ...  In a postapocalyptic world, rag-doll robots hi...
4      s5  ...  A brilliant group of students become card-coun...

[5 rows x 12 columns]

In [42]:
#adding the csv file to the pandas library
import pandas as pd
#Importing the dataset to a dataframe
film_list = pd.read_csv("netflix_titles.csv")
#print the info of this dataframe
print(film_list.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       7787 non-null   object
 1   type          7787 non-null   object
 2   title         7787 non-null   object
 3   director      5398 non-null   object
 4   cast          7069 non-null   object
 5   country       7280 non-null   object
 6   date_added    7777 non-null   object
 7   release_year  7787 non-null   int64
 8   rating        7780 non-null   object
 9   duration      7787 non-null   object
 10  listed_in     7787 non-null   object
 11  description   7787 non-null   object
dtypes: int64(1), object(11)
memory usage: 730.2+ KB
None

In [38]:
#adding the csv file to the pandas library
import pandas as pd
#Importing the dataset to a dataframe
film_list = pd.read_csv("netflix_titles.csv")
#print the last 10 rows of this dataframe
print(film_list.tail(10))

     show_id  ...                                        description
7777   s7778  ...  While living alone in a spooky town, a young g...
7778   s7779  ...  Looking to survive in a world taken over by zo...
7779   s7780  ...  An assortment of talent takes the stage for a ...
7780   s7781  ...  A drug dealer starts having doubts about his t...
7781   s7782  ...  Dragged from civilian life, a former superhero...
7782   s7783  ...  When Lebanon's Civil War deprives Zozo of his ...
7783   s7784  ...  A scrappy but poor boy worms his way into a ty...
7784   s7785  ...  In this documentary, South African rapper Nast...
7785   s7786  ...  Dessert wizard Adriano Zumbo looks for the nex...
7786   s7787  ...  This documentary delves into the mystique behi...

[10 rows x 12 columns]

In [66]:
#adding the csv file to the pandas library
import pandas as pd
#Importing the dataset to a dataframe
film_list = pd.read_csv("netflix_titles.csv")

#disply films produced in the U.S. from the film list
films_produced_in_USA = film_list[film_list['country']=="United States"]
display(films_produced_in_USA)

     show_id  ...                                        description
3         s4  ...  In a postapocalyptic world, rag-doll robots hi...
4         s5  ...  A brilliant group of students become card-coun...
7         s8  ...  After one of his high school students attacks ...
10       s11  ...  A farmer pens a confession admitting to his wi...
14       s15  ...  Stranded when the Earth is suddenly destroyed ...
...      ...  ...                                                ...
7758   s7759  ...  Zack and Miri make and star in an adult film t...
7771   s7772  ...  Born without legs and stuck in foster care for...
7774   s7775  ...  A political cartoonist, a crime reporter and a...
7778   s7779  ...  Looking to survive in a world taken over by zo...
7781   s7782  ...  Dragged from civilian life, a former superhero...

[2555 rows x 12 columns]